# Chapter 7 Exercises

## 7.22 Pandas Series

Perform the following (a - e) tasks with pandas `Series`:

### a.
Create a `Series` from the list `[7, 11, 13, 17]`.

In [1]:
import pandas as pd
series_a = pd.Series([7, 11, 13, 17])
series_a

0     7
1    11
2    13
3    17
dtype: int64

### b.
Create a `Series` with five elements that are all `100.0`.

In [2]:
series_b = pd.Series(100.0, range(5))
series_b

0    100.0
1    100.0
2    100.0
3    100.0
4    100.0
dtype: float64

### c.
Create a `Series` with 20 elements that are all random numbers in the range `0` to `100`. Use method `describe` to produce the `Series`’ basic descriptive statistics.

In [3]:
import numpy as np
series_c = pd.Series((np.random.randint(101) for i in range(20)))
series_c

0     67
1     90
2     82
3     86
4     57
5     19
6      6
7     61
8     12
9     43
10    45
11    24
12    68
13    10
14    32
15    39
16    83
17    11
18    95
19    47
dtype: int64

In [4]:
series_c.describe()

count    20.000000
mean     48.850000
std      29.430158
min       6.000000
25%      22.750000
50%      46.000000
75%      71.500000
max      95.000000
dtype: float64

### d.
Create a `Series` called `temperatures` of the floating-point values `98.6`, `98.9`, `100.2` and `97.9`. Using the `index` keyword argument, specify the custom indices `'Julie'`, `'Charlie'`, `'Sam'` and `'Andrea'`.

In [5]:
temperatures = pd.Series([98.6, 98.9, 100.2, 97.9], index = ['Julie', 'Charlie', 'Sam', 'Andrea'])
temperatures

Julie       98.6
Charlie     98.9
Sam        100.2
Andrea      97.9
dtype: float64

### e.
Form a dictionary from the names and values in Part (d), then use it to initialize a `Series`.

In [6]:
temps_dict = {
    'Julie': 98.6,
    'Charlie': 98.9,
    'Sam': 100.2,
    'Andrea': 97.9
}

temperatures_new = pd.Series(temps_dict)
temperatures_new

Julie       98.6
Charlie     98.9
Sam        100.2
Andrea      97.9
dtype: float64

## 7.23 Pandas Dataframes

Perform the following (a - j) tasks with pandas `DataFrames`:

### a.
Create a `DataFrame` named `temperatures` from a dictionary of three temperature readings each for `'Maxine'`, `'James'` and `'Amanda'`.

In [7]:
temps = {
    'Maxine': [98.4, 99.2, 98.3],
    'James': [99.1, 98.6, 98.5],
    'Amanda': [98.7, 99.0, 97.9]
}

temperatures = pd.DataFrame(temps)
temperatures

   Maxine  James  Amanda
0    98.4   99.1    98.7
1    99.2   98.6    99.0
2    98.3   98.5    97.9

### b.
Recreate the `DataFrame` `temperatures` in Part (a) with custom indices using the `index` keyword argument and a list containing `'Morning'`, `'Afternoon'` and `'Evening'`.

In [8]:
temps = {
    'Maxine': [98.4, 99.2, 98.3],
    'James': [99.1, 98.6, 98.5],
    'Amanda': [98.7, 99.0, 97.9]
}

temperatures = pd.DataFrame(temps, index = ['Morning', 'Afternoon', 'Evening'])
temperatures

           Maxine  James  Amanda
Morning      98.4   99.1    98.7
Afternoon    99.2   98.6    99.0
Evening      98.3   98.5    97.9

### c.
Select from `temperatures` the column of temperature readings for `'Maxine'`.

In [9]:
temperatures.Maxine

Morning      98.4
Afternoon    99.2
Evening      98.3
Name: Maxine, dtype: float64

### d.
Select from `temperatures` the row of `'Morning'` temperature readings.

In [10]:
temperatures.loc['Morning']

Maxine    98.4
James     99.1
Amanda    98.7
Name: Morning, dtype: float64

### e.
Select from `temperatures` the rows for `'Morning'` and `'Evening'` temperature readings.

In [11]:
temperatures.loc[['Morning', 'Evening']]

         Maxine  James  Amanda
Morning    98.4   99.1    98.7
Evening    98.3   98.5    97.9

### f.
Select from `temperatures` the columns of temperature readings for `'Amanda'` and `'Maxine'`.

In [12]:
temperatures.loc[:,['Amanda', 'Maxine']]

           Amanda  Maxine
Morning      98.7    98.4
Afternoon    99.0    99.2
Evening      97.9    98.3

### g.
Select from `temperatures` the elements for `'Amanda'` and `'Maxine'` in the `'Morning'` and `'Afternoon'`.

In [14]:
temperatures.loc[['Morning', 'Afternoon'], ['Amanda', 'Maxine']]

           Amanda  Maxine
Morning      98.7    98.4
Afternoon    99.0    99.2

### h.
Use the describe method to produce temperatures’ descriptive statistics.

In [15]:
temperatures.describe()

          Maxine      James     Amanda
count   3.000000   3.000000   3.000000
mean   98.633333  98.733333  98.533333
std     0.493288   0.321455   0.568624
min    98.300000  98.500000  97.900000
25%    98.350000  98.550000  98.300000
50%    98.400000  98.600000  98.700000
75%    98.800000  98.850000  98.850000
max    99.200000  99.100000  99.000000

### i.
Transpose temperatures.

In [16]:
temperatures.T

        Morning  Afternoon  Evening
Maxine     98.4       99.2     98.3
James      99.1       98.6     98.5
Amanda     98.7       99.0     97.9

### j.
Sort temperatures so that its column names are in alphabetical order.

In [17]:
temperatures.sort_index(axis = 1)

           Amanda  James  Maxine
Morning      98.7   99.1    98.4
Afternoon    99.0   98.6    99.2
Evening      97.9   98.5    98.3

# Chapter 8 Exercises

## 8.3 Pig Latin

Write a script that encodes English-language phrases into a form of coded language called pig Latin. To translate each English word into a pig Latin word, place the first letter of the English word at the end of the word and add the letters “ay.” Thus, the word “jump” becomes “umpjay,” the word “the” becomes “hetay,” and the word “computer” becomes “omputercay.” If the word starts with a vowel, just add “ay.”

In [19]:
def to_pig_latin(phrase):
    """Encode an English phrase to pig Latin"""
    
    words = phrase.split()
    extension = 'ay'
    vowels = ['a', 'e', 'i', 'o', 'u']
    pig_latin_words = []
    
    for word in words:
        
        if word[0] in vowels:
            pig_latin_word = word + extension
        
        else:
            pig_latin_word = word[1:] + word[0] + extension
            
        pig_latin_words.append(pig_latin_word)
        
    new_phrase = ' '.join(pig_latin_words)
    return new_phrase

phrase_in = input('Enter a phrase to be translated to pig Latin: ')
translated = to_pig_latin(phrase_in)
print(f'Translated: {translated}')

Enter a phrase to be translated to pig Latin: pig latin is super cool
Translated: igpay atinlay isay upersay oolcay

## 8.8 Converting Letters to Emojis

Display 10 emojis beginning with the smiley face, which has the value 0x1F600.

In [20]:
base_emoji = 0x1F600

for num in range(10):
    print(f'{base_emoji + num:c}', end = ' ')

😀 😁 😂 😃 😄 😅 😆 😇 😈 😉

## 8.13 Regular Expressions: Condense Spaces to a Single Space

Check whether a sentence contains more than one space between words. If so, remove the extra spaces and display the results. For example, `'Hello  World'` should become `'Hello World'`.

In [24]:
import re

def condense_spaces(sentence):
    """Remove extra spaces from a sentence"""
    return re.sub(r'\s+', ' ', sentence)

print(condense_spaces('What is    up?'))
print(condense_spaces('This   had a lot        of  extra    spaces, but not    anymore!'))
print(condense_spaces('Hello  World'))

What is up?
This had a lot of extra spaces, but not anymore!
Hello World